Revit 2027 API
ParameterTypeId.PlanViewViewDir Property
 "View Direction"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlanViewViewDir { get; }
Public Shared ReadOnly Property PlanViewViewDir As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlanViewViewDir {
	ForgeTypeId^ get ();
}
static member PlanViewViewDir : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace